#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "28800"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "hcim_service"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = jsonencode(
            {
              + id   = "0000010"
              + name = "MOH crs"
            }
        )
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.keycloak_openid_user_session_note_protocol_mapper.Client-Host will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-Host" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientHost"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client Host"
      + realm_id            = "moh_applications"
      + session_note        = "clientHost"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.keycloak_openid_user_session_note_protocol_mapper.Client-ID will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-ID" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientId"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client ID"
      + realm_id            = "moh_applications"
      + session_note        = "clientId"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.keycloak_openid_user_session_note_protocol_mapper.Client-IP-Address will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-IP-Address" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientAddress"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client IP Address"
      + realm_id            = "moh_applications"
      + session_note        = "clientAddress"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*